# 3. Написать скрипт, который будет выводить текущую дату и время.
import datetime 
print(datetime.datetime.now())

